## Plan Result (nonprod_dynatrace_activegate)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Replace
  * azurerm_role_assignment.virtual_machine_admin
  * azurerm_role_assignment.virtual_machine_user




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.virtual_machine_admin must be replaced
-/+ resource "azurerm_role_assignment" "virtual_machine_admin" {
      ~ id                               = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/dynatrace-activegate-nonprod/providers/Microsoft.Authorization/roleAssignments/d71adb71-ba13-e824-3fd8-4858ec27dcaf" -> (known after apply)
      ~ name                             = "d71adb71-ba13-e824-3fd8-4858ec27dcaf" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" -> "/providers/Microsoft.Authorization/roleDefinitions/1c0163c0-47e6-4577-8991-ea5c82e286e4" # forces replacement
      ~ role_definition_name             = "Virtual Machine Administrator Login" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.virtual_machine_user must be replaced
-/+ resource "azurerm_role_assignment" "virtual_machine_user" {
      ~ id                               = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/dynatrace-activegate-nonprod/providers/Microsoft.Authorization/roleAssignments/04b2d6df-fc4b-0b5f-7ce7-0b64c3224e12" -> (known after apply)
      ~ name                             = "04b2d6df-fc4b-0b5f-7ce7-0b64c3224e12" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/providers/Microsoft.Authorization/roleDefinitions/fb879df8-f326-4884-b1cf-06f3ad86be52" -> "/providers/Microsoft.Authorization/roleDefinitions/fb879df8-f326-4884-b1cf-06f3ad86be52" # forces replacement
      ~ role_definition_name             = "Virtual Machine User Login" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":14,"Program":"tfcmt","SHA1":"","Target":"nonprod_dynatrace_activegate","Vars":{}} -->